# <div align="center">SERIES</div>

In [2]:
import numpy as np
import pandas as pd

In [3]:
a=['a','b','c','d','e']
d=['a','b','c','d','e']
b=[1,2,3,4,5]
c={1:'a',2:'b',3:'c',4:'d',5:'e'}

In [4]:
x=pd.Series(b,a)
y=pd.Series(b,d)

In [5]:
z=x+y
type(z)

pandas.core.series.Series

In [6]:
print(z[:'c'])

a    2
b    4
c    6
dtype: int64

In [7]:
print(z['c'])

6

# <div align='center'>DATAFRAMES</div>

In [8]:
a=[1,2,3,4,5]
b=[0,2,4,6,8]
c=[1,3,5,7,9]
d=[0,1,2,3,4]

In [9]:
df=pd.DataFrame([a,b,c,d],['a','b','c','d'],['p','q','x','y','z'])

In [10]:
df

   p  q  x  y  z
a  1  2  3  4  5
b  0  2  4  6  8
c  1  3  5  7  9
d  0  1  2  3  4

In [11]:
df['s']=df['y']+df['z']   #adding the column

In [12]:
df

   p  q  x  y  z   s
a  1  2  3  4  5   9
b  0  2  4  6  8  14
c  1  3  5  7  9  16
d  0  1  2  3  4   7

In [13]:
df.drop('a') #to delete the row temporarily

   p  q  x  y  z   s
b  0  2  4  6  8  14
c  1  3  5  7  9  16
d  0  1  2  3  4   7

In [14]:
df.drop('a',inplace=True)  #to delete the row a permanently

In [15]:
df.drop('s',axis=1,inplace=True)  #to delete the column permanently

In [16]:
df

   p  q  x  y  z
b  0  2  4  6  8
c  1  3  5  7  9
d  0  1  2  3  4

In [17]:
df['z']   #to access the elements of column z

b    8
c    9
d    4
Name: z, dtype: int64

In [19]:
df.loc['b'] #to access the elements of  row a

p    0
q    2
x    4
y    6
z    8
Name: b, dtype: int64

In [20]:
df.iloc[0]  #to access the elements of  row by index number

p    0
q    2
x    4
y    6
z    8
Name: b, dtype: int64

In [22]:
df.loc['b','z']  #to access the element of specific row and specific column

8

### Conditional Accessing

In [23]:
df>3

       p      q      x      y     z
b  False  False   True   True  True
c  False  False   True   True  True
d  False  False  False  False  True

In [24]:
df[df>3]

    p   q    x    y  z
b NaN NaN  4.0  6.0  8
c NaN NaN  5.0  7.0  9
d NaN NaN  NaN  NaN  4

In [26]:
df[df['y']>3]  #print all rows in the 'y' column which are greater than 3

   p  q  x  y  z
b  0  2  4  6  8
c  1  3  5  7  9

In [29]:
df[df['y']>3][['p','y']] #to print only 'p' and 'q' column in above dataFrame

   p  y
b  0  6
c  1  7

In [33]:
df[(df['x']>4)  & (df['y']>4)]  #for multiple conditions we can't use 'and' and 'or', we should use & and  |

   p  q  x  y  z
c  1  3  5  7  9

### Missing Values

In [3]:
import numpy as np
import pandas as pd

In [7]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[1,5,6,np.nan,np.nan],'d':[4,5,np.nan,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan,np.nan]}

In [8]:
df=pd.DataFrame(d)  #make a dataframe

In [9]:
df

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0
1  2  7.0  5.0  5.0  NaN
2  3  8.0  6.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [10]:
df.dropna(axis=0)  #In pandas axis=0 means rows. So, all the rows with nan values will get eliminated.

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0

In [14]:
df.dropna(axis=1)   #In pandas axis=1 means columns. So, all the columns with nan values will get eliminated.

   a
0  1
1  2
2  3
3  4
4  5

In [15]:
df.dropna(thresh=5)  #get all the values with at least 5

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0

In [17]:
df.fillna(1)  #fill all nan with 1

   a    b    c    d    e
0  1  6.0  1.0  4.0  5.0
1  2  7.0  5.0  5.0  1.0
2  3  8.0  6.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [19]:
df['b'].fillna(df['b'].mean()) #fill the nan of column b with mean

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64

### Analysing data using groupby

In [9]:
d={'days':['sun','sun','mon','mon','tues','tues','tues'],'values':[10000,5000,6000,15000,2000,18000,3900]}

In [10]:
df=pd.DataFrame(d)

In [11]:
df

   days  values
0   sun   10000
1   sun    5000
2   mon    6000
3   mon   15000
4  tues    2000
5  tues   18000
6  tues    3900

In [14]:
x=df.groupby('days')   #will group the dataframe according to the days

In [15]:
x.mean()   #mean of values of grouped days

            values
days
mon   10500.000000
sun    7500.000000
tues   7966.666667

In [20]:
#x.max()
#x.min()   
#x.describe()  #will display count,mean,std,min,max..
x.describe().transpose()

days                   mon           sun          tues
values count      2.000000      2.000000      3.000000
       mean   10500.000000   7500.000000   7966.666667
       std     6363.961031   3535.533906   8740.900030
       min     6000.000000   5000.000000   2000.000000
       25%     8250.000000   6250.000000   2950.000000
       50%    10500.000000   7500.000000   3900.000000
       75%    12750.000000   8750.000000  10950.000000
       max    15000.000000  10000.000000  18000.000000

### Joining

In [65]:
x=pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8]},index=['p','x','y','z'])
y=pd.DataFrame({'c':[0,2,4,6],'d':[1,3,5,7]},index=['s','t','u','v'])

In [66]:
x.join(y)   #join x and y horizontally   (default how is left)

   a  b   c   d
p  1  5 NaN NaN
x  2  6 NaN NaN
y  3  7 NaN NaN
z  4  8 NaN NaN

In [67]:
x.join(y,how='outer')   #outer means print all

     a    b    c    d
p  1.0  5.0  NaN  NaN
s  NaN  NaN  0.0  1.0
t  NaN  NaN  2.0  3.0
u  NaN  NaN  4.0  5.0
v  NaN  NaN  6.0  7.0
x  2.0  6.0  NaN  NaN
y  3.0  7.0  NaN  NaN
z  4.0  8.0  NaN  NaN

In [68]:
x.join(y,how='right')  #index of right will be printed

    a   b  c  d
s NaN NaN  0  1
t NaN NaN  2  3
u NaN NaN  4  5
v NaN NaN  6  7

In [69]:
x.join(y,how='inner')  #index of both common

Empty DataFrame
Columns: [a, b, c, d]
Index: []

### Concatinating

In [72]:
df1=pd.DataFrame({'a':[1,2,3,4],'b':[5,6,7,8]})
df2=pd.DataFrame({'c':[0,2,4,6],'d':[1,3,5,7]})

In [74]:
pd.concat([df1,df2]) #columns will be shared (default axis is 0)

     a    b    c    d
0  1.0  5.0  NaN  NaN
1  2.0  6.0  NaN  NaN
2  3.0  7.0  NaN  NaN
3  4.0  8.0  NaN  NaN
0  NaN  NaN  0.0  1.0
1  NaN  NaN  2.0  3.0
2  NaN  NaN  4.0  5.0
3  NaN  NaN  6.0  7.0

In [76]:
pd.concat([df1,df2],axis=1)    #indexes will be shared

   a  b  c  d
0  1  5  0  1
1  2  6  2  3
2  3  7  4  5
3  4  8  6  7

### Merging

In [91]:
df1=pd.DataFrame({'key':[1,2,3,4],'a':[5,6,7,8],'b':[4,5,8,3],'key1':[0,2,4,6]})
df2=pd.DataFrame({'key':[0,2,4,6],'c':[1,3,5,7],'d':[8,3,2,5],'key1':[0,2,4,8]})

In [92]:
pd.merge(df1,df2)  #index of both common are printed ('on' will hav default value which are common columns, how will be default- inner)

   key  a  b  key1  c  d
0    2  6  5     2  3  3

In [94]:
pd.merge(df1,df2,on='key')  #key1_x and key1_y because we have defined on 'key' only

   key  a  b  key1_x  c  d  key1_y
0    2  6  5       2  3  3       2
1    4  8  3       6  5  2       4

In [97]:
pd.merge(df1,df2,on=['key','key1'])

   key  a  b  key1  c  d
0    2  6  5     2  3  3

### Loading data into pandas

In [101]:
x=pd.read_csv('file_for_pandas.csv')

In [103]:
#x

### More Operations

In [127]:
x=pd.DataFrame({'a':[1,2,3,4],'b':[6,4,5,5]})

In [128]:
x

   a  b
0  1  6
1  2  4
2  3  5
3  4  5

In [129]:
x.index   #print indexes

RangeIndex(start=0, stop=4, step=1)

In [130]:
x.columns  #print columns

Index(['a', 'b'], dtype='object')

In [131]:
x['b'].sum()  #print sum of values of column b

20

In [132]:
def add(x):
    x=x+100
    return x
x['b'].apply(add)    #apply the function to each element of column b

0    106
1    104
2    105
3    105
Name: b, dtype: int64

In [133]:
x.sort_values('b')

   a  b
1  2  4
2  3  5
3  4  5
0  1  6

In [137]:
x['b'].unique()  #print unique values of column b

array([6, 4, 5])

In [138]:
x['b'].nunique() #print number of unique elements in column b

3

In [140]:
x['b'].value_counts() #count the number of each element of b

5    2
4    1
6    1
Name: b, dtype: int64

In [141]:
x.isnull()

       a      b
0  False  False
1  False  False
2  False  False
3  False  False